const ap = new APlayer({
    container: document.getElementById('aplayer'),
    fixed: true,
    autoplay: false,
    theme: '#b7daff',
    loop: 'all',
    order: 'list',
    preload: 'auto',
    volume: 0.5,
    lrcType: 3,
    mutex: true,
    listFolded: false,

    audio: [{
            name: '平凡之路 (Live版)',
            artist: '朴树',
            lrc: '[/music/lrc/by:忽明忽暗的风声][00:00.000] 作曲 : 朴树[00:01.000] 作词 : 朴树/韩寒[00:05.67]编曲：朴树[00:12.12]徘徊着的 在路上的[00:17.47]你要走吗 via via[00:23.30]易碎的 骄傲着[00:28.85]那也曾是我的模样[00:34.65]沸腾着的 不安着的[00:40.36]你要去哪 via via[00:46.10]谜一样的 沉默着的[00:51.85]故事你真的在听吗[00:56.35]我曾经跨过山和大海[00:59.65]也穿过人山人海[01:02.80]我曾经拥有着一切[01:05.10]转眼都飘散如烟[01:07.85]我曾经失落失望失掉所有方向[01:12.56]直到看见平凡才是唯一的答案[01:31.80]当你仍然[01:33.20]还在幻想[01:38.50]你的明天 via via[01:43.10]她会好吗 还是更烂[01:49.88]对我而言是另一天[01:53.43]我曾经毁了我的一切[01:56.64]只想永远地离开[01:59.92]我曾经堕入无边黑暗[02:02.24]想挣扎无法自拔[02:04.89]我曾经像你像他像那野草野花[02:10.64]绝望着 渴望着[02:13.64]也哭也笑平凡着[02:40.32]哟[02:46.03]耶[02:51.89]jia do[02:59.01]la so[02:59.32]哦~[03:03.48]向前走 就这么走[03:06.33]就算你被给过什么[03:09.18]向前走 就这么走[03:11.93]就算你被夺走什么[03:14.88]向前走 就这么走[03:17.68]就算你会错过什么[03:21.51]向前走 就这么走[03:23.23]就算你会[03:25.88]我曾经跨过山和大海[03:28.24]也穿过人山人海[03:30.54]我曾经拥有着一切[03:33.79]转眼都飘散如烟[03:36.34]我曾经失落失望失掉所有方向[03:42.14]直到看见平凡才是唯一的答案[03:47.79]我曾经毁了我的一切[03:50.94]只想永远地离开[03:53.49]我曾经堕入无边黑暗[03:56.39]想挣扎无法自拔[03:59.14]我曾经像你像他像那野草野花[04:04.89]绝望着 渴望着 也哭也笑平凡着[04:10.74]我曾经跨过山和大海[04:13.64]也穿过人山人海[04:16.24]我曾经问遍整个世界[04:19.59]从来没得到答案[04:22.98]我不过像你像他像那野草野花[04:27.74]冥冥中这是我 唯一要走的路啊[04:34.75]时间无言[04:36.25]如此这般[04:40.40]明天已在 via via[04:46.55]风吹过的 路依然远[04:52.65]你的故事讲到了哪',
            //cover: 'https://p1.music.126.net/SpovasHBud2A1qXXADXsBg==/109951163167455610.jpg?param=300x300',
            url: 'http://music.163.com/song/media/outer/url?id=553543175.mp3'
            },
            {
                name: '天空之城（经典钢琴版）（翻自 久石譲） ',
                artist: 'dylanf',
                lrc: '/music/lrc/[00:00.00] 暂无歌词',
                //cover: 'https://p1.music.126.net/1YrCPOBV314i-mTtlDg8mQ==/109951164148664637.jpg?param=300x300',
                url: 'http://music.163.com/song/media/outer/url?id=864711417.mp3'
            },
            {
                name: '大鱼',
                artist: '周深',
                lrc: '/music/lrc/[00:00.000] 作曲 : 钱雷[00:01.000] 作词 : 尹约[00:43.20]海浪无声将夜幕深深淹没[00:49.87]漫过天空尽头的角落[00:56.69]大鱼在梦境的缝隙里游过[01:03.69]凝望你沉睡的轮廓[01:08.64][01:09.85]看海天一色 听风起雨落[01:16.44]执子手吹散苍茫茫烟波[01:23.33]大鱼的翅膀 已经太辽阔[01:31.13]我松开时间的绳索[01:36.04][01:37.12]怕你飞远去  怕你离我而去[01:43.92]更怕你永远停留在这里[01:50.81]每一滴泪水 都向你流淌去[01:58.35]倒流进天空的海底[02:03.40][02:19.34]海浪无声将夜幕深深淹没[02:25.85]漫过天空尽头的角落[02:32.79]大鱼在梦境的缝隙里游过[02:39.61]凝望你沉睡的轮廓[02:44.39][02:45.59]看海天一色 听风起雨落[02:52.53]执子手吹散苍茫茫烟波[02:59.37]大鱼的翅膀 已经太辽阔[03:07.10]我松开时间的绳索[03:12.05][03:13.11]看你飞远去  看你离我而去[03:19.95]原来你生来就属于天际[03:26.87]每一滴泪水 都向你流淌去[03:34.58]倒流回最初的相遇[03:59.31][04:08.02]',
                //cover: 'https://p1.music.126.net/1YrCPOBV314i-mTtlDg8mQ==/109951164148664637.jpg?param=300x300',
                url: 'http://music.163.com/song/media/outer/url?id=413812448.mp3'
            },
            {
                name: '步步-五月天',
                artist: '西轰Eight',
                lrc: '/music/lrc/[by:满脸是血已经送往医院了][00:00.000] 作曲 : 阿信[00:01.000] 作词 : 阿信[00:06.94]编曲：阿信，Cola Kai[00:17.63][00:18.07]空无一人的大街 闯入无人婚纱店[00:24.22][00:24.59]为你披上雪白誓言[00:31.18][00:31.50]世界已灰飞烟灭 而爱矗立高楼间[00:37.84][00:38.16]你是真的 或是我的 幻觉[00:44.75][00:45.16]时光遗忘的背面 独坐残破的台阶[00:51.64][00:52.01]哪个乱世没有离别[00:58.61][00:58.92]天空和我的中间 只剩倾盆的思念[01:05.25][01:05.62]如果相识 不能相恋[01:08.20][01:08.56]是不是还不如擦肩[01:12.19][01:12.41]在失去你的风景里面[01:15.68][01:15.98]你却占据了每一条街[01:19.27][01:19.66]一步步曾经 一步步想念 在脚下蔓延[01:25.84][01:26.17]在充满你的回忆里面[01:29.46][01:29.75]我独自流浪海角天边[01:32.98][01:33.29]一步步走过 当时心愿[01:40.01][01:40.38]格林威治大钟前 归零超载的伤悲[01:46.53][01:46.90]背着我和我的诺言[01:53.57][01:53.85]一起计划的路线 对照孤单的旅店[02:00.44][02:00.71]一声晚安 却又唤醒 泪腺[02:07.27][02:07.57]时代广场的跨年 颐和花季的蓝天[02:14.19][02:14.45]数着愿望在你指尖[02:20.96][02:21.26]当时有多少心愿 就有多少的残缺[02:27.70][02:27.97]如果后悔 不能后退[02:31.48][02:31.93]是不是就只能往前[02:34.51][02:34.92]在失去你的风景里面[02:38.01][02:38.35]你却占据了每一条街[02:41.42][02:41.70]一步步曾经 一步步想念 在脚下蔓延[02:48.21][02:48.48]在充满你的回忆里面[02:51.80][02:52.08]我独自流浪海角天边[02:55.37][02:55.68]一步步走过 当时心愿[03:02.19][03:02.56]生如浮萍般卑微 爱却苍穹般壮烈[03:08.93][03:09.36]我要为你爬上最险山岳[03:14.13][03:14.40]走过最崎岖眷恋 一步一步穿越[03:22.74][03:23.01]在失去你的风景里面[03:26.17][03:26.46]你却占据了整个世界[03:29.56][03:29.86]每一张相片 每一个房间 每一滴眼泪[03:36.06][03:36.29]在充满你的回忆里面[03:39.76][03:40.06]我独自一人和眼泪周旋[03:42.93][03:43.31]一步步走向 孤单的明天[03:50.06][03:50.33]也许在来生的 某个明天[03:53.49][03:53.73]我们能再写 新的情节[03:56.91][03:57.17]一步步完成 当时心愿[04:03.83][04:04.22]一步步完成 最美残缺[04:12.78]',
                //cover: 'https://p1.music.126.net/1YrCPOBV314i-mTtlDg8mQ==/109951164148664637.jpg?param=300x300',
                url: 'http://music.163.com/song/media/outer/url?id=420397651.mp3'
            },
            {
                name: '春庭雪',
                artist: '等什么君',
                //lrc: '/music/lrc/[by:满脸是血已经送往医院了][00:00.000] 作曲 : 阿信[00:01.000] 作词 : 阿信[00:06.94]编曲：阿信，Cola Kai[00:17.63][00:18.07]空无一人的大街 闯入无人婚纱店[00:24.22][00:24.59]为你披上雪白誓言[00:31.18][00:31.50]世界已灰飞烟灭 而爱矗立高楼间[00:37.84][00:38.16]你是真的 或是我的 幻觉[00:44.75][00:45.16]时光遗忘的背面 独坐残破的台阶[00:51.64][00:52.01]哪个乱世没有离别[00:58.61][00:58.92]天空和我的中间 只剩倾盆的思念[01:05.25][01:05.62]如果相识 不能相恋[01:08.20][01:08.56]是不是还不如擦肩[01:12.19][01:12.41]在失去你的风景里面[01:15.68][01:15.98]你却占据了每一条街[01:19.27][01:19.66]一步步曾经 一步步想念 在脚下蔓延[01:25.84][01:26.17]在充满你的回忆里面[01:29.46][01:29.75]我独自流浪海角天边[01:32.98][01:33.29]一步步走过 当时心愿[01:40.01][01:40.38]格林威治大钟前 归零超载的伤悲[01:46.53][01:46.90]背着我和我的诺言[01:53.57][01:53.85]一起计划的路线 对照孤单的旅店[02:00.44][02:00.71]一声晚安 却又唤醒 泪腺[02:07.27][02:07.57]时代广场的跨年 颐和花季的蓝天[02:14.19][02:14.45]数着愿望在你指尖[02:20.96][02:21.26]当时有多少心愿 就有多少的残缺[02:27.70][02:27.97]如果后悔 不能后退[02:31.48][02:31.93]是不是就只能往前[02:34.51][02:34.92]在失去你的风景里面[02:38.01][02:38.35]你却占据了每一条街[02:41.42][02:41.70]一步步曾经 一步步想念 在脚下蔓延[02:48.21][02:48.48]在充满你的回忆里面[02:51.80][02:52.08]我独自流浪海角天边[02:55.37][02:55.68]一步步走过 当时心愿[03:02.19][03:02.56]生如浮萍般卑微 爱却苍穹般壮烈[03:08.93][03:09.36]我要为你爬上最险山岳[03:14.13][03:14.40]走过最崎岖眷恋 一步一步穿越[03:22.74][03:23.01]在失去你的风景里面[03:26.17][03:26.46]你却占据了整个世界[03:29.56][03:29.86]每一张相片 每一个房间 每一滴眼泪[03:36.06][03:36.29]在充满你的回忆里面[03:39.76][03:40.06]我独自一人和眼泪周旋[03:42.93][03:43.31]一步步走向 孤单的明天[03:50.06][03:50.33]也许在来生的 某个明天[03:53.49][03:53.73]我们能再写 新的情节[03:56.91][03:57.17]一步步完成 当时心愿[04:03.83][04:04.22]一步步完成 最美残缺[04:12.78]',
                //cover: 'https://p1.music.126.net/1YrCPOBV314i-mTtlDg8mQ==/109951164148664637.jpg?param=300x300',
                url: 'http://ws.stream.qqmusic.qq.com/C4000036hiOc1PzcKd.m4a?guid=886916074&vkey=C9F7431EA747F26B1253B38DAB6D74615438853473ED161873C9F31C26F1DE05E993CCABB6BA5CC636BE443230B1F10F68415990E2EBF7D9&uin=0&fromtag=66'
            },
            {
                name: '天使的翅膀',
                artist: '徐誉滕',
                //lrc: '',
                //cover: '',
                url: 'http://36.158.236.143/amobile.music.tc.qq.com/C400004XHjVj0H0qBe.m4a?guid=522931183&vkey=4F798CE78599238962C28899168035853F4AA17FA28655942679B72DDAA9FB54F3E3049B7EC669F1C008F3ACCF9AAFB268268D947282C800&uin=0&fromtag=66'
            },
        ]
});

